In [1]:
data = [['Steve',25,55],['Linus',28,60],['Elon',26]]

In [2]:
data

[['Steve', 25, 55], ['Linus', 28, 60], ['Elon', 26]]

In [5]:
import pandas as pd
df=pd.DataFrame(data)

In [6]:
df

       0   1     2
0  Steve  25  55.0
1  Linus  28  60.0
2   Elon  26   NaN

In [14]:
df.columns=['Name','Age','weight']

In [11]:
df

    Name  Age  weight
0  Steve   25    55.0
1  Linus   28    60.0
2   Elon   26     NaN

In [15]:
df.isnull()

    Name    Age  weight
0  False  False   False
1  False  False   False
2  False  False    True

In [16]:
df.isnull().sum()

Name      0
Age       0
weight    1
dtype: int64

In [19]:
df.dropna()

    Name  Age  weight
0  Steve   25    55.0
1  Linus   28    60.0

In [34]:
import numpy as np
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values = np.nan,strategy ='mean')
  
SimpleImputer()  
imputer = imputer.fit(df[['weight']])
  
dat = imputer.transform(df[['weight']])
dat

array([[55. ],
       [60. ],
       [57.5]])

In [35]:
df.fillna(df.mean())

    Name  Age  weight
0  Steve   25    55.0
1  Linus   28    60.0
2   Elon   26    57.5

In [42]:
from sklearn.preprocessing import StandardScaler
std = StandardScaler()
X = std.fit_transform(df[['Age','weight']])
X

array([[-1.06904497, -1.        ],
       [ 1.33630621,  1.        ],
       [-0.26726124,         nan]])

In [43]:
df_cat = pd.DataFrame(data = 
                     [['green','M',10.1,'class1'],
                      ['blue','L',20.1,'class2'],
                      ['white','M',30.1,'class1']])
df_cat.columns = ['color','size','price','classlabel']

In [44]:
df_cat

   color size  price classlabel
0  green    M   10.1     class1
1   blue    L   20.1     class2
2  white    M   30.1     class1

In [47]:
from sklearn.preprocessing import LabelEncoder
cat_values=df_cat[['color']].apply(LabelEncoder().fit_transform)
cat_values

   color
0      1
1      0
2      2

In [49]:
print(pd.get_dummies(df_cat))

   price  color_blue  color_green  color_white  size_L  size_M  \
0   10.1           0            1            0       0       1
1   20.1           1            0            0       1       0
2   30.1           0            0            1       0       1

   classlabel_class1  classlabel_class2
0                  1                  0
1                  0                  1
2                  1                  0